# combining data sets

In [1]:
import numpy as np
import pandas as pd

In [2]:
x=[1,2,3]
y=[4,5,6]
z=[7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [3]:
# concatenation in pandas
s1=pd.Series(['A','B','C'],index=[1,2,3])
s2=pd.Series(['D','E','F'])
pd.concat([s1,s2])

1    A
2    B
3    C
0    D
1    E
2    F
dtype: object

In [4]:
pd.concat([s1,s2],axis=1)

     0    1
1    A    E
2    B    F
3    C  NaN
0  NaN    D

In [5]:
pd.concat([s1,s2],axis=0)

1    A
2    B
3    C
0    D
1    E
2    F
dtype: object

In [7]:
# as you see in above the index is not same so we can ignore index also
pd.concat([s1,s2],axis=0,ignore_index=True)

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

In [8]:
pd.concat([s1,s2],axis=1,ignore_index=True)

     0    1
1    A    E
2    B    F
3    C  NaN
0  NaN    D

In [10]:
# use of keys as index
pd.concat([s1,s2],keys=['s1','s2'],axis=0)

s1  1    A
    2    B
    3    C
s2  0    D
    1    E
    2    F
dtype: object

In [11]:
pd.concat([s1,s2],keys=['s1','s2'],axis=1)

    s1   s2
1    A    E
2    B    F
3    C  NaN
0  NaN    D

In [12]:
# using join
pd.concat([s1,s2],join='inner')

1    A
2    B
3    C
0    D
1    E
2    F
dtype: object

In [13]:
pd.concat([s1,s2],join='outer')

1    A
2    B
3    C
0    D
1    E
2    F
dtype: object

In [14]:
pd.concat([s1,s2],join='inner',axis=1)

   0  1
1  A  E
2  B  F

In [15]:
pd.concat([s1,s2],axis=1)

     0    1
1    A    E
2    B    F
3    C  NaN
0  NaN    D

In [16]:
pd.concat([s1,s2],join='outer',axis=1)

     0    1
1    A    E
2    B    F
3    C  NaN
0  NaN    D

In [23]:
pd.concat([s1,s2],axis=1)

     0    1
1    A    E
2    B    F
3    C  NaN
0  NaN    D

# append() will also works as concat

In [26]:
s1.append(s2)

AttributeError: 'Series' object has no attribute 'append'

In [29]:
def make_df(cols, ind):
    """Quickly make a DataFrame"""
    data = {c: [str(c) + str(i) for i in ind]
            for c in cols}
    return pd.DataFrame(data, ind)

# example DataFrame
make_df('ABC', range(3))
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
display(df1,df2)

    A   B
1  A1  B1
2  A2  B2

    A   B
3  A3  B3
4  A4  B4

In [32]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

# MERGE AND JOINS

In [33]:
df1=pd.DataFrame({'employee':['preet','priya','anu','priyanka'],
                 'group':['DS','DA','BA','Enginering']})
df2=pd.DataFrame({'employee':['priya','anu','priyanka','preet'],
                 'joining_year':[2019,2022,20015,2023]})
df1

   employee       group
0     preet          DS
1     priya          DA
2       anu          BA
3  priyanka  Enginering

In [34]:
df2

   employee  joining_year
0     priya          2019
1       anu          2022
2  priyanka         20015
3     preet          2023

In [35]:
# merge both default merge
pd.merge(df1,df2)

   employee       group  joining_year
0     preet          DS          2023
1     priya          DA          2019
2       anu          BA          2022
3  priyanka  Enginering         20015

In [37]:
pd.concat([df1,df2],axis=1)

   employee       group  employee  joining_year
0     preet          DS     priya          2019
1     priya          DA       anu          2022
2       anu          BA  priyanka         20015
3  priyanka  Enginering     preet          2023

In [38]:
df3=pd.merge(df1,df2,on='employee')

In [39]:
df3

   employee       group  joining_year
0     preet          DS          2023
1     priya          DA          2019
2       anu          BA          2022
3  priyanka  Enginering         20015

In [40]:
df4=pd.DataFrame({'group':['DA','DS','BA'],
                 'supervisor':['anshike','anju','dev']})
df4

  group supervisor
0    DA    anshike
1    DS       anju
2    BA        dev

# merge many to one

In [42]:
pd.merge(df3,df4) # this merge automatically

  employee group  joining_year supervisor
0    preet    DS          2023       anju
1    priya    DA          2019    anshike
2      anu    BA          2022        dev

In [43]:
df5=pd.DataFrame({'group':['DA','DS','BA','DA','BA','DS'],
                 'skills':['math','python','java','coding','linux','unix']})
df5

  group  skills
0    DA    math
1    DS  python
2    BA    java
3    DA  coding
4    BA   linux
5    DS    unix

In [44]:
pd.merge(df1,df5)

  employee group  skills
0    preet    DS  python
1    preet    DS    unix
2    priya    DA    math
3    priya    DA  coding
4      anu    BA    java
5      anu    BA   linux

In [46]:
pd.merge(df1,df5,on='group')

  employee group  skills
0    preet    DS  python
1    preet    DS    unix
2    priya    DA    math
3    priya    DA  coding
4      anu    BA    java
5      anu    BA   linux

In [49]:
df3=pd.DataFrame({'name':['preet','priya','priyanka','anu'],
                 'salary':[70000,80000,90000,234000]})
df1

   employee       group
0     preet          DS
1     priya          DA
2       anu          BA
3  priyanka  Enginering

In [50]:
df3

       name  salary
0     preet   70000
1     priya   80000
2  priyanka   90000
3       anu  234000

In [51]:
pd.merge(df1,df3,left_on='employee',right_on='name')

   employee       group      name  salary
0     preet          DS     preet   70000
1     priya          DA     priya   80000
2       anu          BA       anu  234000
3  priyanka  Enginering  priyanka   90000

In [52]:
pd.merge(df1,df3,left_on='employee',right_on='name').drop('name',axis=1)

   employee       group  salary
0     preet          DS   70000
1     priya          DA   80000
2       anu          BA  234000
3  priyanka  Enginering   90000

In [54]:
# set index
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')

In [55]:
df1a

               group
employee
preet             DS
priya             DA
anu               BA
priyanka  Enginering

In [56]:
df2a

          joining_year
employee
priya             2019
anu               2022
priyanka         20015
preet             2023

In [57]:
pd.merge(df1a,df2a,left_index=True,right_index=True)

               group  joining_year
employee
preet             DS          2023
priya             DA          2019
anu               BA          2022
priyanka  Enginering         20015

# join

In [58]:
df1a.join(df2a)

               group  joining_year
employee
preet             DS          2023
priya             DA          2019
anu               BA          2022
priyanka  Enginering         20015

In [60]:
df1.join(df3)

   employee       group      name  salary
0     preet          DS     preet   70000
1     priya          DA     priya   80000
2       anu          BA  priyanka   90000
3  priyanka  Enginering       anu  234000

JOIN PERFORMS A MERGE THAT DEFAULTS TO JOINING ON INDICES

In [66]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns=['name', 'drink'])
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [67]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [68]:
pd.merge(df6,df7)

   name   food drink
0  Mary  bread  wine

In [69]:
pd.merge(df6,df7,how='inner')

   name   food drink
0  Mary  bread  wine

In [70]:
pd.merge(df6,df7,how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [71]:
pd.merge(df6,df7,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [72]:
pd.merge(df6,df7,how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [74]:
pd.merge(df6,df7,how='right').isnull().any()

name     False
food      True
drink    False
dtype: bool

# Aggregation and grouping

In [75]:
df=pd.read_csv('/home/mohit/Desktop/4achivers/stock_daily_prices.csv')

In [76]:
df

,Date,AAPL,BA,T,MGM,AMZN,IBM,TSLA,GOOG,sp500
0,2012-01-12,60.198570,75.510002,30.120001,12.130000,175.929993,180.550003,28.250000,313.644379,1295.500000
1,2012-01-13,59.972858,74.599998,30.070000,12.350000,178.419998,179.160004,22.790001,311.328064,1289.089966
2,2012-01-17,60.671429,75.239998,30.250000,12.250000,181.660004,180.000000,26.600000,313.116364,1293.670044
3,2012-01-18,61.301430,75.059998,30.330000,12.730000,189.440002,181.070007,26.809999,315.273285,1308.040039
4,2012-01-19,61.107143,75.559998,30.420000,12.800000,194.449997,180.520004,26.760000,318.590851,1314.500000
...,...,...,...,...,...,...,...,...,...,...
2154,2020-08-05,440.250000,174.279999,29.850000,16.719999,3205.030029,125.449997,1485.020020,1473.609985,3327.770020
2155,2020-08-06,455.609985,172.199997,29.840000,18.459999,3225.000000,126.120003,1489.579956,1500.099976,3349.159912
2156,2020-08-07,444.450012,170.020004,30.020000,19.030001,3167.459961,124.959999,1452.709961,1494.489990,3351.280029
2157,2020-08-10,450.910004,179.410004,30.200001,21.650000,3148.159912,127.110001,1418.569946,1496.099976,3360.469971
2158,2020-08-11,437.500000,180.130005,30.200001,21.500000,3080.669922,126.750000,1374.390015,1480.319946,3333.689941

In [77]:
df.head(),df.tail()

(         Date       AAPL         BA          T    MGM        AMZN         IBM  \
 0  2012-01-12  60.198570  75.510002  30.120001  12.13  175.929993  180.550003
 1  2012-01-13  59.972858  74.599998  30.070000  12.35  178.419998  179.160004
 2  2012-01-17  60.671429  75.239998  30.250000  12.25  181.660004  180.000000
 3  2012-01-18  61.301430  75.059998  30.330000  12.73  189.440002  181.070007
 4  2012-01-19  61.107143  75.559998  30.420000  12.80  194.449997  180.520004

         TSLA        GOOG        sp500
 0  28.250000  313.644379  1295.500000
 1  22.790001  311.328064  1289.089966
 2  26.600000  313.116364  1293.670044
 3  26.809999  315.273285  1308.040039
 4  26.760000  318.590851  1314.500000  ,
             Date        AAPL          BA          T        MGM         AMZN  \
 2154  2020-08-05  440.250000  174.279999  29.850000  16.719999  3205.030029
 2155  2020-08-06  455.609985  172.199997  29.840000  18.459999  3225.000000
 2156  2020-08-07  444.450012  170.020004  30.020000  19.030001  3167.459961
 2157  2020-08-10  450.910004  179.410004  30.200001  21.650000  3148.159912
 2158  2020-08-11  437.500000  180.130005  30.200001  21.500000  3080.669922

              IBM         TSLA         GOOG        sp500
 2154  125.449997  1485.020020  1473.609985  3327.770020
 2155  126.120003  1489.579956  1500.099976  3349.159912
 2156  124.959999  1452.709961  1494.489990  3351.280029
 2157  127.110001  1418.569946  1496.099976  3360.469971
 2158  126.750000  1374.390015  1480.319946  3333.689941  )

In [78]:
df.head

<bound method NDFrame.head of             Date        AAPL          BA          T        MGM         AMZN  \
0     2012-01-12   60.198570   75.510002  30.120001  12.130000   175.929993
1     2012-01-13   59.972858   74.599998  30.070000  12.350000   178.419998
2     2012-01-17   60.671429   75.239998  30.250000  12.250000   181.660004
3     2012-01-18   61.301430   75.059998  30.330000  12.730000   189.440002
4     2012-01-19   61.107143   75.559998  30.420000  12.800000   194.449997
...          ...         ...         ...        ...        ...          ...
2154  2020-08-05  440.250000  174.279999  29.850000  16.719999  3205.030029
2155  2020-08-06  455.609985  172.199997  29.840000  18.459999  3225.000000
2156  2020-08-07  444.450012  170.020004  30.020000  19.030001  3167.459961
2157  2020-08-10  450.910004  179.410004  30.200001  21.650000  3148.159912
2158  2020-08-11  437.500000  180.130005  30.200001  21.500000  3080.669922

             IBM         TSLA         GOOG        sp500
0     180.550003    28.250000   313.644379  1295.500000
1     179.160004    22.790001   311.328064  1289.089966
2     180.000000    26.600000   313.116364  1293.670044
3     181.070007    26.809999   315.273285  1308.040039
4     180.520004    26.760000   318.590851  1314.500000
...          ...          ...          ...          ...
2154  125.449997  1485.020020  1473.609985  3327.770020
2155  126.120003  1489.579956  1500.099976  3349.159912
2156  124.959999  1452.709961  1494.489990  3351.280029
2157  127.110001  1418.569946  1496.099976  3360.469971
2158  126.750000  1374.390015  1480.319946  3333.689941

[2159 rows x 10 columns]>

In [79]:
df.tail()

,Date,AAPL,BA,T,MGM,AMZN,IBM,TSLA,GOOG,sp500
2154,2020-08-05,440.250000,174.279999,29.850000,16.719999,3205.030029,125.449997,1485.020020,1473.609985,3327.770020
2155,2020-08-06,455.609985,172.199997,29.840000,18.459999,3225.000000,126.120003,1489.579956,1500.099976,3349.159912
2156,2020-08-07,444.450012,170.020004,30.020000,19.030001,3167.459961,124.959999,1452.709961,1494.489990,3351.280029
2157,2020-08-10,450.910004,179.410004,30.200001,21.650000,3148.159912,127.110001,1418.569946,1496.099976,3360.469971
2158,2020-08-11,437.500000,180.130005,30.200001,21.500000,3080.669922,126.750000,1374.390015,1480.319946,3333.689941

In [81]:
df.head()

,Date,AAPL,BA,T,MGM,AMZN,IBM,TSLA,GOOG,sp500
0,2012-01-12,60.198570,75.510002,30.120001,12.13,175.929993,180.550003,28.250000,313.644379,1295.500000
1,2012-01-13,59.972858,74.599998,30.070000,12.35,178.419998,179.160004,22.790001,311.328064,1289.089966
2,2012-01-17,60.671429,75.239998,30.250000,12.25,181.660004,180.000000,26.600000,313.116364,1293.670044
3,2012-01-18,61.301430,75.059998,30.330000,12.73,189.440002,181.070007,26.809999,315.273285,1308.040039
4,2012-01-19,61.107143,75.559998,30.420000,12.80,194.449997,180.520004,26.760000,318.590851,1314.500000

In [83]:
df.sum()

Date     2012-01-122012-01-132012-01-172012-01-182012-0...
AAPL                                         304029.996972
BA                                           410086.289918
T                                             75916.699983
MGM                                           49885.299983
AMZN                                        1976922.170563
IBM                                          349440.630208
TSLA                                         560478.160273
GOOG                                        1692035.313721
sp500                                       4790280.287214
dtype: object

In [85]:
np.mean(df.BA)

189.94270028624362

In [86]:
df.columns

Index(['Date', 'AAPL', 'BA', 'T', 'MGM', 'AMZN', 'IBM', 'TSLA', 'GOOG',
       'sp500'],
      dtype='object')

In [87]:
df.Date

0       2012-01-12
1       2012-01-13
2       2012-01-17
3       2012-01-18
4       2012-01-19
           ...
2154    2020-08-05
2155    2020-08-06
2156    2020-08-07
2157    2020-08-10
2158    2020-08-11
Name: Date, Length: 2159, dtype: object

In [90]:
df.BA.mean()

189.94270028624362

In [93]:
data=pd.DataFrame({'key':['A','B','C','A','B','C'],
                'data':range(6)},
                columns=['key','data'])
data

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [95]:
data.groupby('key')

In [96]:
data.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [99]:
df.head()

,Date,AAPL,BA,T,MGM,AMZN,IBM,TSLA,GOOG,sp500
0,2012-01-12,60.198570,75.510002,30.120001,12.13,175.929993,180.550003,28.250000,313.644379,1295.500000
1,2012-01-13,59.972858,74.599998,30.070000,12.35,178.419998,179.160004,22.790001,311.328064,1289.089966
2,2012-01-17,60.671429,75.239998,30.250000,12.25,181.660004,180.000000,26.600000,313.116364,1293.670044
3,2012-01-18,61.301430,75.059998,30.330000,12.73,189.440002,181.070007,26.809999,315.273285,1308.040039
4,2012-01-19,61.107143,75.559998,30.420000,12.80,194.449997,180.520004,26.760000,318.590851,1314.500000

In [100]:
df.groupby('BA')

In [101]:
df.groupby('BA')['MGM']

In [102]:
df.groupby('BA')['MGM'].median()

BA
67.239998     10.370000
67.500000     10.410000
67.580002     10.920000
69.019997     11.220000
69.150002     10.330000
                ...
430.119995    26.889999
432.690002    26.840000
435.440002    27.160000
439.959991    26.750000
440.619995    26.980000
Name: MGM, Length: 1965, dtype: float64

In [103]:
df.groupby('BA')['MGM'].describe()

,count,mean,std,min,25%,50%,75%,max
BA,,,,,,,,
67.239998,1.0,10.370000,NaN,10.370000,10.370000,10.370000,10.370000,10.370000
67.500000,1.0,10.410000,NaN,10.410000,10.410000,10.410000,10.410000,10.410000
67.580002,1.0,10.920000,NaN,10.920000,10.920000,10.920000,10.920000,10.920000
69.019997,1.0,11.220000,NaN,11.220000,11.220000,11.220000,11.220000,11.220000
69.150002,1.0,10.330000,NaN,10.330000,10.330000,10.330000,10.330000,10.330000
...,...,...,...,...,...,...,...,...
430.119995,1.0,26.889999,NaN,26.889999,26.889999,26.889999,26.889999,26.889999
432.690002,1.0,26.840000,NaN,26.840000,26.840000,26.840000,26.840000,26.840000
435.440002,1.0,27.160000,NaN,27.160000,27.160000,27.160000,27.160000,27.160000
439.959991,1.0,26.750000,NaN,26.750000,26.750000,26.750000,26.750000,26.750000
440.619995,1.0,26.980000,NaN,26.980000,26.980000,26.980000,26.980000,26.980000

In [104]:
df.groupby('BA')['MGM'].describe().unstack()

       BA
count  67.239998      1.000000
       67.500000      1.000000
       67.580002      1.000000
       69.019997      1.000000
       69.150002      1.000000
                       ...
max    430.119995    26.889999
       432.690002    26.840000
       435.440002    27.160000
       439.959991    26.750000
       440.619995    26.980000
Length: 15720, dtype: float64

In [105]:
df1=pd.DataFrame({'key':list('ABCABC'),
                 'data1':range(6),
                 'data2':np.random.randint(0,10,6)},
                columns=['key','data1','data2'])
df1

  key  data1  data2
0   A      0      8
1   B      1      3
2   C      2      7
3   A      3      9
4   B      4      0
5   C      5      8

In [110]:
df1.groupby('key').aggregate(['min',np.median,max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     8    8.5   9
B       1    2.5   4     0    1.5   3
C       2    3.5   5     7    7.5   8

In [111]:
df1.groupby('key').aggregate({'data1':'min','data2':'max'})

     data1  data2
key
A        0      9
B        1      3
C        2      8

In [112]:
df1.groupby('key').std()

       data1     data2
key
A    2.12132  0.707107
B    2.12132  2.121320
C    2.12132  0.707107

In [113]:
df1

  key  data1  data2
0   A      0      8
1   B      1      3
2   C      2      7
3   A      3      9
4   B      4      0
5   C      5      8

# Transform in groupby

In [115]:
df1.groupby('key').transform(lambda x:x-x.mean())

   data1  data2
0   -1.5   -0.5
1   -1.5    1.5
2   -1.5   -0.5
3    1.5    0.5
4    1.5   -1.5
5    1.5    0.5

# apply() method

In [117]:
def nbd(x):
    x['data1']/=x['data2'].sum()
    return x

df1.groupby('key').apply(nbd)

      key     data1  data2
key
A   0   A  0.000000      8
    3   A  0.176471      9
B   1   B  0.333333      3
    4   B  1.333333      0
C   2   C  0.133333      7
    5   C  0.333333      8

# Specifying the split key

In [119]:
l=[0,1,0,1,2,0]
df1.groupby(l).sum()

   key  data1  data2
0  ACC      7     23
1   BA      4     12
2    B      4      0

In [123]:
df1.groupby(df1['key']).sum()

     data1  data2
key
A        3     17
B        5      3
C        7     15